# Generate a brewfile 
# > brew bundle dump
# Clean up so you current system configuration to match your brewfile
# > brew bundle --force cleanup
# tips
# mas <appname> install from mac app store
# cask <appname> install  mac UI APP
# brew bundle

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"

brew "docker"
brew "docker-compose"
brew "node"
brew "zsh"
brew "wget"
brew "nmap"
brew "htop"
brew "sqlite"
# mc
brew "midnight-commander"
brew "mitmproxy"
brew "watchman"
brew "imagemagick"
brew "rsync"
brew "php"
brew "yara"
brew "tree"
brew "youtube-dl"
brew "virtualenv"
cask "android-sdk"


cask "drawio"
cask "fork"
cask "gimp"
cask "google-chrome"
cask "iterm2"
cask "macpass"
cask "obsidian"
cask "sublime-text"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
